//DOOMMOVE PROC DIRECTION='N'
//*
//* DOOM Movement Procedure
//* Processes player movement in specified direction
//*
//MOVE     EXEC PGM=DOOMMV,PARM='&DIRECTION'
//STEPLIB  DD DSN=DOOM.LOADLIB,DISP=SHR
//GAMESTAT DD DSN=DOOM.GAMESTATE,DISP=OLD
//LEVEL    DD DSN=DOOM.LEVEL001,DISP=SHR
//SYSPRINT DD SYSOUT=*
//